# Одноклеточная амеба каждые 3 часа делится на 2 такие же амёбы.
# Необходимо определить, сколько будет амеб через n часов, если первоначально была только одна амёба.
# Формат входных данных: Вводится целое положительное число n.
# Формат выходных данных: Требуется одно число — конечное число амеб.

quantity_hour = int(input())
quantity_circle = quantity_hour//3
for i in range(1, quantity_circle):
  print(2 ** quantity_circle)
